Revit 2027 API
MultiReferenceAnnotationOptions.TagHasLeader Property
 When true the tag will be created with an attached leader. When false the tag will be created without a leader.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool TagHasLeader { get; set; }
Public Property TagHasLeader As Boolean
	Get
	Set
public:
property bool TagHasLeader {
	bool get ();
	void set (bool value);
}
member TagHasLeader : bool with get, set
Property Value
Boolean
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace